import com.alibaba.fastjson.JSON;
import com.alibaba.fastjson.JSONObject;

import java.math.BigDecimal;
import java.util.Map;
import java.util.Set;

public class TestMap {
    private static String s = "{\"code\":\"0\",\"data\":{\"day_180_data\":{\"trade_total_data\":{\"因还款能力不足导致失败的交易总金额\":null,\"还款成功最大金额\":1000.00,\"还款成功最小金额\":800.00,\"因还款能力不足导致失败的交易笔数占比\":null,\"交易总笔数\":3.00,\"还款成功总笔数\":3.00,\"消费金融类交易最大金额\":null,\"交易总金额\":2600.00,\"还款成功机构数（去重计数）\":1.00,\"因还款能力不足导致失败的交易总笔数\":null,\"还款成功总金额\":2600.00},\"small_loan_data\":{\"还款成功金额占比\":1.00,\"还款成功机构数\":1.00,\"还款成功笔数占比\":1.00,\"还款成功最小金额\":800.00,\"交易最大金额\":1000.00,\"交易失败次数>0的机构数\":0,\"因还款能力不足导致失败的交易笔数占比\":null,\"还款成功总笔数\":3.00,\"因还款能力不足导致失败的交易金额占比\":null,\"还款成功总金额\":2600.00}},\"number_20_trade\":{\"trade_total_data\":{\"还款成功金额占比\":0.73,\"还款成功最大金额\":1000.00,\"因还款能力不足导致失败的交易最大金额\":null,\"还款成最小金额\":600.00,\"消费金融类交易总金额\":null,\"消费金融类交易总笔数\":null,\"还款成功总笔数\":5.00,\"交易总金额\":4800.00,\"还款成功机构数（去重计数）\":1.00,\"还款成功总金额\":3400.00},\"small_loan_data\":{\"因还款能力不足导致失败的交易总金额\":null,\"还款成功金额占比\":0.73,\"因还款能力不足导致失败的交易最大金额\":null,\"机构数（去重计数）\":1.00,\"还款成功最小金额\":600.00,\"还款成功总笔数\":5.00,\"交易总金额\":4800.00,\"近20次小贷担保类还款成功的笔数占总时段的比例\":0.83,\"还款成功机构数（去重计数）\":1.00,\"还款成功总金额\":3400.00}},\"number_50_trade\":{\"trade_total_data\":{\"因还款能力不足导致失败的交易总金额\":null,\"还款成功金额占比\":0.73,\"机构数（去重计数）\":1.00,\"消费金融类交易总金额\":null,\"交易最大金额\":1400.00,\"消费金融类交易总笔数\":null,\"因还款能力不足导致失败的交易最小金额\":null,\"还款成功总笔数\":5.00,\"交易总金额\":4800.00,\"因还款能力不足导致失败的交易金额占比\":null,\"还款成功机构数（去重计数）\":1.00,\"还款成功总金额\":3400.00},\"small_loan_data\":{\"还款成功金额占比\":0.73,\"因还款能力不足导致失败的交易最大金额\":null,\"还款成功笔数占比\":0.83,\"还款成功最小金额\":600.00,\"因还款能力不足导致失败的交易最小金额\":null,\"交易最小金额\":600.00,\"交易总金额\":4800.00,\"还款成功机构数（去重计数）\":1.00}},\"total_data\":{\"trade_total_data\":{\"交易失败向后距离下一次还款成功的最小天数\":76.00,\"交易距离当前最小天数\":109.00,\"还款成功最大金额\":1000.00,\"因还能力不足导致失败的交易距离当前最大天数\":null,\"机构数（去重计数）\":1.00,\"交易失败向后距离下一次还款成功的最大天数\":76.00,\"交易距离当前最大天数\":530.00,\"最近一次交易为交易失败机构数\":0,\"交易总笔数\":6.00,\"交易总金额\":4800.00,\"消费金融类交易距离当前最小天数\":null,\"还款成功的交易距离当前最小天数\":109.00,\"还款成功总金额\":3400.00,\"因还款能力不足导致失败的最小交易金额\":null,\"还款成功的交易距离当前最大天数\":530.00,\"还款成功笔数占比\":0.83,\"消费金融类交易总金额\":null,\"还款成功总笔数\":5.00,\"因还能力不足导致失败的交易笔数占比\":null,\"因还款能力不足导致失败的交易金额占比\":null,\"因还款能力不足导致失败的交易距离当前最小天数\":null},\"small_loan_data\":{\"交易失败向后距离下一次还款成功的最小天数\":76.00,\"交易距离当前最小天数\":109.00,\"还款成功的交易距离当前最大天数\":530.00,\"交易失败向后距离下一次还款成功的最大天数\":76.00,\"交易距离当前最大天数\":530.00,\"因还款能力不足导致失败的交易笔数占比\":null,\"还款成功总笔数\":5.00,\"因还款能力不足导致失败的交易距离当前最大天数\":null,\"最后一次交易失败后交易次数\":3.00,\"还款成功的交易距离当前最小天数\":109.00,\"因还款能力不足导致失败的交易距离当前最小天数\":null,\"还款成功总金额\":3400.00}},\"day_90_data\":{\"trade_total_data\":{\"因还款能力不足导致失败的交易总金额\":null,\"还款成功最大金额\":null,\"还款成功最小金额\":null,\"交易总笔数\":null,\"交易最小金额\":null,\"近90天还款成功金额占总时段的比例\":null,\"近90天因还款能力不足导致失败的交易笔数占总时段的比例\":null,\"还款成功总金额\":null,\"还款成功金额占比\":null,\"还款成功笔数占比\":null,\"交易最大金额\":null,\"因还款能力不足导致失败的交易最小金额\":null,\"交易失败次数>0的机构数\":0,\"因还款能力不足导致失败的交易金额占比\":null},\"small_loan_data\":{\"还款成功最大金额\":null,\"机构数（去重计数）\":0,\"近90天小贷担保类还款成功的笔数占同时段的比例\":null,\"近90天小贷担保类因还款能力不足导致失败的交易笔数占总时段的比例\":null,\"交易最小金额\":null,\"交易总金额\":null,\"还款成功总金额\":null,\"还款成功金额占比\":null,\"还款成功笔数占比\":null,\"交易最大金额\":null,\"因还款能力不足导致失败的交易最小金额\":null,\"交易失败次数>0的机构数\":0,\"因还能力不足导致失败的交易笔数占比\":null,\"因还款能力不足导致失败的交易金额占比\":null,\"近90天小贷担保类还款成功的金额占同时段的比例\":null}},\"day_360_data\":{\"trade_total_data\":{\"还款成功金额占比\":0.66,\"因还款能力不足导致失败的交易最大金额\":null,\"还款成功笔数占比\":0.75,\"消费金融类交易总金额\":null,\"消费金融类交易总笔数\":null,\"因还款能力不足导致失败的交易笔数占比\":null,\"还款成功总笔数\":3.00,\"因还款能力不足导致失败的交易金额占比\":null,\"还款成功总金额\":2600.00},\"small_loan_data\":{\"还款成功金额占比\":0.66,\"还款成功笔数占比\":0.75,\"还款成功最小金额\":800.00,\"交易最大金额\":1400.00,\"交易失败次数>0的机构数\":1.00,\"因还款能力不足导致失败的交易笔数占比\":null,\"还款成功总笔数\":3.00,\"交易总金额\":3800.00,\"还款成功总金额\":2600.00}},\"number_5_trade\":{\"trade_total_data\":{\"因还款能力不足导致失败的交易总金额\":null,\"还款成功金额占比\":0.71,\"还款成功最大金额\":1000.00,\"近5次因还款能力不足导致失败的交易笔数占总时段的比例\":null,\"还款成功最小金额\":600.00,\"交易最大金额\":1400.00,\"近5次因还款能力不足导致失败的交易金额占总时段的比例\":null,\"还款成功总笔数\":4.00,\"交易总金额\":4200.00,\"因还款能力不足导致失败的交易总笔数\":null,\"近5次交易还款成功笔数占总时段的比例\":0.80,\"还款成功总金额\":3000.00},\"small_loan_data\":{\"因还款能力不足导致失败的交易总金额\":null,\"还款成功金额占比\":0.71,\"因还款能力不足导致失败的交易最大金额\":null,\"交易最大金额\":1400.00,\"近5次小贷担保类还款成功的笔数占总时段的比例\":0.80,\"交易最小金额\":600.00,\"近5次小贷担保类因还款能力不足导致失败的交易金额占总时段的比例\":null,\"交易总金额\":4200.00,\"因还款能力不足导致失败的交易金额占比\":null,\"还款成功总金额\":3000.00}},\"number_100_trade\":{\"trade_total_data\":{\"还款成功金额占比\":0.73,\"还款成功最大金额\":1000.00,\"交易最大金额\":1400.00,\"还款成功总笔数\":5.00,\"交易总金额\":4800.00,\"因还款能力不足导致失败的交易金额占比\":null,\"还款成功机构数（去重计数）\":1.00,\"还款成功总金额\":3400.00},\"small_loan_data\":{\"还款成功金额占比\":0.73,\"还款成功最大金额\":1000.00,\"还款成功最小金额\":600.00,\"交易最大金额\":1400.00,\"因还款能力不足导致失败的交易笔数占比\":null,\"还款成功总笔数\":5.00,\"交易总金额\":4800.00,\"因还款能力不足导致失败的交易金额占比\":null,\"还款成功机构数（去重计数）\":1.00,\"因还款能力不足导致失败的交易总笔数\":null,\"还款成功总金额\":3400.00}}},\"msg\":\"success\"}";


    public static void main(String[] args) {
        JSONObject jsonObject = JSON.parseObject(s);
        System.out.println(jsonObject);
        JSONObject jonsdate = jsonObject.getJSONObject("data");
        System.out.println(jonsdate);

        JSONObject day180Data = jonsdate.getJSONObject("day_180_data");
        System.out.println(jonsdate);

        JSONObject json = day180Data.getJSONObject("trade_total_data");
        System.out.println(json);

        BigDecimal 还款成功最大金额 = json.getBigDecimal("还款成功最大金额");

        Map<Object, Object> objectObjectMap = jsonToMap(json);

        Set<Map.Entry<Object, Object>> entries = objectObjectMap.entrySet();
        for(Map.Entry<Object, Object> entry : entries){
            System.out.println(entry.getKey());
            System.out.println(objectObjectMap.get(entry.getKey()));
        }

        /*HashMap<String,Object> data = Maps.newHashMap();
        data.put("你好",null);
        data.put("世界","xxxx");

        Set<Map.Entry<String, Object>> entries = data.entrySet();
        for(Map.Entry<String,Object> entry : entries){
            System.out.println(entry.getKey());
           System.out.println(data.get(entry.getKey()));
        }*/


    }


    public static Map<Object, Object> jsonToMap(Object jsonObj) {
        net.sf.json.JSONObject jsonObject = net.sf.json.JSONObject.fromObject(jsonObj);
        Map<Object, Object> map = (Map)jsonObject;
        return map;
    }

}
